app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @phone_number = params[:user][:phone_number]
    if !@phone_number.nil?
      message = "Welcome to North Star"
      @twilio_client_four = Twilio::REST::Client.new("AC50070372767bdf26a090b08007bba07f", "8ae1cdbb08d55b99cab34174c3cd8bbb")
      @twilio_client_four.account.sms.messages.create(
        :from => "+1#{"2245209581"}",
        :to => @phone_number,
        :body => (message)
      )
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "location", "password_salt", "persistence_token", "phone_number", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"